'use strict'
1)
//обьясни своими словами что такое 'Подьем' в javascript
hosting
2)
//можно ли использовать let перед ее обьявлением?
// да
3)
//можно ли использовать const перед ее обьявлением?
// да
4)
//что такое 'use strict'
// оно запускает js в строгом режиме
5)
//можно ли использовать в строгом режиме необьявленные переменные?
// строго запрещено
6)
//где нужно писать 'use strict'?
//  в самом начале
7)
//запрещено ли использовать переменную без обьявления в строгом режиме?
// строго запрещено
8)
//запрещено ли использовать обьект без обьявления в строгом режиме?
// строго запрещено
9)
//запрещено ли удалять переменную/обьект без обьявления в строгом режиме?
// строго запрещено
10)
//запрещено ли удалять функцию строгом режиме?
// строго запрещено
11)
//запрещено ли создавать одинаковые переменные в строгом режиме?
// строго запрещено