// 1)
//cоздайте обработчик события клик для элемента ниже

// 2)
//cоздайте проверку try...catch... для созданного ранее обработчика
function laka(params) {
    a=value
  try {
    
  } catch (error) {
    
  }  
}
// 3)
//cоздайте проверку try...catch...finally... для созданного ранее обработчика
try {
    
} catch (error) {
    
}
finally {

}
// 4)
//oпиши своими словами, что делает try
// ловит ошибку
// 5)
//oпиши своими словами, что делает catch
// меняет её
// 6)
//oпиши своими словами, что делает throw
// создает ошибку
// 7)
//oпиши своими словами, что делает finally
// оно делает действие всегда
// 8)
//какие два свойства принимает обьект err
//  не знаю
// 9)
//кто выдает ошибка EvalError
//  не знаю
// 10)
//что выдает ошибка RangeError
//  не знаю
// 11)
//что выдает ошибка ReferenceError
//  не знаю
// 12)
//что выдает ошибка SyntaxError
//  не знаю
// 13)
//что выдает ошибка TypeError
//  не знаю
// 14)
//что выдает ошибка URIError
//  не знаю